app/views/artists/index.html.erb

SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
---
  <li><%= link_to artist.name, artist_songs_path(artist) %></li>
  <% artist.songs.each do |song|%>